<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0dfa771ed904b7c2f3a296f23c8806b5e65cc25ae2b26f80d3265a51500045fe","plan_job_ref":"Job Terraform plan (OIDC) #27 at https://github.com/hackforla/incubator/actions/runs/13865747677","plan_out_hash":"89e1fc1012774171e2f0405bb519d5dc8e3ebceced0f484a34b9e582a58a797a","plan_hash":"c3e4ff69c2c5700089cb6119ab0112efb49dd9ddb3a2e0361ff6946a5ee0070f","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_service.aws_ecs_service.fargate[0] will be updated in-place
!~  resource "aws_ecs_service" "fargate" {
        id                                 = "arn:aws:ecs:us-west-2:035866691871:service/incubator-prod/civic-tech-jobs-fs-stage"
        name                               = "civic-tech-jobs-fs-stage"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage:1" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_service.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
!~      arn                      = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage:1" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage" -> (known after apply)
!~      container_definitions    = (sensitive value) # forces replacement
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "************************" -> (known after apply)
!~      revision                 = 1 -> (known after apply)
-       tags                     = {} -> null
!~      tags_all                 = {} -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_stage_database.postgresql_grant.user will be updated in-place
!~  resource "postgresql_grant" "user" {
        id                = "civic-tech-jobs_fullstack_stage_user_civic-tech-jobs_fullstack_stage_public_table"
!~      privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
#        (5 unchanged attributes hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_stage_database.postgresql_grant.viewer will be updated in-place
!~  resource "postgresql_grant" "viewer" {
        id                = "civic-tech-jobs_fullstack_stage_viewer_civic-tech-jobs_fullstack_stage_public_table"
!~      privileges        = [
+           "SELECT",
        ]
#        (5 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan (OIDC) #27](https://github.com/hackforla/incubator/actions/runs/13865747677)